In [22]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
world_cup_matches=pd.read_csv('WorldCupMatches.csv')
world_cup_players=pd.read_csv('WorldCupPlayers.csv')
world_cup=pd.read_csv('WorldCups.csv')

In [629]:

#Establish connection with postgres
conn_url = 'postgresql://postgres:999116tt@localhost/postgres'
engine = create_engine(conn_url)
connection = engine.connect()


# Pass the SQL statements that create all tables
stmt = """
    CREATE TABLE teams(
        team_id serial,
        team_initial varchar(10) NOT null UNIQUE,
        Country varchar(100) NOT null UNIQUE,
        PRIMARY KEY(team_id)
    );

    CREATE TABLE referees(
        referee_id serial,
        name varchar(100) NOT NULL,
        country_initial varchar(10) NOT NULL, 
        PRIMARY KEY(referee_id)
    );

    CREATE TABLE stadiums(
        stadium_id serial,
        Stadium varchar(50) NOT NULL,
        City varchar(50) NOT NULL,
        PRIMARY KEY(stadium_id)
    );

    CREATE TABLE worldcup(
        worldcup_year int,
        Country varchar(100) NOT NULL,
        GoalsScored int NOT NULL,
        QualifiedTeams int NOT NULL,
        MatchesPlayed int NOT NULL,
        Attendance int NOT NULL,
        PRIMARY KEY(worldcup_year)
    );

    CREATE TABLE worldcup_ranking(
        Year int,
        team_id int,
        ranking varchar(50) NOT NULL,
        CONSTRAINT chk_ranking CHECK (ranking IN ('Winner','Runners_up','Third','Fourth','Not_ranked')),
        PRIMARY KEY(Year,team_id),
        FOREIGN KEY(Year) REFERENCES worldcup(worldcup_year), 
        FOREIGN KEY(team_id) REFERENCES teams(team_id)
    );


    CREATE TABLE matches(
        MatchID int,
        Year int NOT NULL,
        stage varchar(50) NOT NULL,
        home_team_goals int NOT NULL,
        away_team_goals int NOT NULL,
        half_time_home_team_goals int NOT NULL,
        half_time_away_team_goals int NOT NULL,
        Attendance int NOT NULL,
        home_team_id int,
        away_team_id int,
        stadium_id int,
        PRIMARY KEY(MatchID),
        FOREIGN KEY (stadium_id) REFERENCES stadiums(stadium_id),
        FOREIGN KEY (home_team_id) REFERENCES teams(team_id),
        FOREIGN KEY (away_team_id) REFERENCES teams(team_id),
        FOREIGN KEY (Year) REFERENCES worldcup(worldcup_year)
    );

    CREATE TABLE matches_referees(
        MatchID int,
        referee_id int,
        referee_role varchar(100),
        CONSTRAINT chk_referee_role CHECK (referee_role IN ('Main','Linesman')),
        PRIMARY KEY(MatchID,referee_id),
        FOREIGN KEY(MatchID) REFERENCES matches(MatchID),
        FOREIGN KEY(referee_id) REFERENCES referees(referee_id)
    );

    CREATE TABLE players(
        player_id serial,
        player_name varchar(100) NOT NULL,
        PRIMARY KEY(player_id)
    );

    CREATE TABLE match_players(
        MatchID int,
        player_id int,
        team_id int,
        coach_name varchar(100) NOT NULL,
        line_up char(1) NOT NULL,
        shirt_no int NOT NULL,
        Position varchar(5),
        PRIMARY KEY(MatchID,player_id),
        FOREIGN KEY(MatchID) REFERENCES matches(MatchID),
        FOREIGN KEY(player_id) REFERENCES players(player_id),
        FOREIGN KEY(team_id) REFERENCES teams(team_id)
    );


    CREATE TABLE goals_scored(
        MatchID int,
        player_id int,
        event varchar(10) NOT NULL,
        PRIMARY KEY(MatchID,player_id,event),
        FOREIGN KEY(MatchID) REFERENCES matches(MatchID),
        FOREIGN KEY(player_id) REFERENCES players(player_id)
    );


"""
connection.execute(stmt)

In [626]:

# Create teams dataframe
#home team initial and name
subset1 = world_cup_matches[['Home Team Initials','Home Team Name']]
home_teams = subset1.drop_duplicates()
home_teams = home_teams.dropna()
home_teams = home_teams.rename(columns={'Home Team Initials':'Team Initials','Home Team Name':'Country'})


#away team inital and name
away_teams = world_cup_matches[['Away Team Initials','Away Team Name']].drop_duplicates()
away_teams = away_teams.dropna()
away_teams = away_teams.rename(columns={'Away Team Initials':'Team Initials','Away Team Name':'Country'})

#combine the dataframe and remove duplicates
teams = home_teams.append(away_teams)
teams = teams.drop_duplicates()

#drop duplicated team initials
teams = teams[teams['Country']!='IR Iran']

#insert team_id
teams.insert(0,'team_id',range(1,1+len(teams)))
teams.rename(columns={'Team Initials':'team_initial','Country':'country'},inplace=True)
teams

/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/1645524307.py:15: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  teams = home_teams.append(away_teams)

     team_id team_initial            country
0          1          FRA             France
1          2          USA                USA
2          3          YUG         Yugoslavia
3          4          ROU            Romania
4          5          ARG          Argentina
..       ...          ...                ...
19        78          EGY              Egypt
36        79          INH  Dutch East Indies
201       80          ISR             Israel
207       81          SLV        El Salvador
318       82          KUW             Kuwait

[82 rows x 3 columns]

In [630]:
teams.to_sql(name='teams', con=engine, if_exists='append', index=False)

82

In [552]:
# Create Referees table
main_ref = world_cup_matches[['Referee']]
assistant1 = world_cup_matches[['Assistant 1']]
assistant1 = assistant1.rename(columns={'Assistant 1':'Referee'})
assistant2 = world_cup_matches[['Assistant 2']]
assistant2 = assistant2.rename(columns={'Assistant 2':'Referee'})
referees_na = main_ref.append(assistant1).append(assistant2)
referees_na = referees_na.dropna()
referees = referees_na.drop_duplicates()
referees.insert(0,'referee_id',range(1,1+len(referees)))

#split column referees to name and country initial
new = referees['Referee'].str.split('(',expand=True)
referees['Referee'] = new[0].str.rstrip(' ')
referees['country_initial'] = new[1].str.rstrip(')') 
referees.rename(columns={'Referee':'name'},inplace=True)
referees

/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/614993527.py:7: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  referees_na = main_ref.append(assistant1).append(assistant2)
/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/614993527.py:14: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  referees['Referee'] = new[0].str.rstrip(' ')
/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/614993527.py:15: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  referees['country_initial'] = new[1].str.rstrip(')')
/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/614993527.py:16: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  referees.rename(columns={'Referee':'name'},inplace=True)

     referee_id              name country_initial
0             1  LOMBARDI Domingo             URU
1             2       MACIAS Jose             ARG
2             3     TEJADA Anibal             URU
3             4   WARNKEN Alberto             CHI
4             5     REGO Gilberto             BRA
..          ...               ...             ...
791         655        TRIGO Jose             POR
797         656        ANAZ Hakan             AUS
800         657         RULE Mark             NZL
804         658     SALEH Ebrahim             BHR
805         659  KABANDA Felicien             RWA

[659 rows x 3 columns]

In [631]:
referees.to_sql(name='referees', con=engine, if_exists='append', index=False)

659

In [554]:
stadium_city = world_cup_matches[['Stadium','City']]
stadiums_na = stadium_city.dropna()
stadiums = stadiums_na.drop_duplicates()
stadiums.insert(0,'stadium_id',range(1,1+len(stadiums)))
stadiums.rename(columns={'Stadium':'stadium','City':'city'},inplace=True)
stadiums

/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/3395176990.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  stadiums.rename(columns={'Stadium':'stadium','City':'city'},inplace=True)

     stadium_id                  stadium             city
0             1                  Pocitos      Montevideo
1             2           Parque Central      Montevideo
8             3       Estadio Centenario      Montevideo
18            4  Stadio Benito Mussolini           Turin
19            5        Giorgio Ascarelli          Naples
..          ...                      ...              ...
779         179         Arena Pernambuco          Recife
780         180         Estadio Nacional        Brasilia
781         181        Estadio Beira-Rio    Porto Alegre
782         182      Estadio do Maracana  Rio De Janeiro
784         183         Arena da Baixada        Curitiba

[183 rows x 3 columns]

In [458]:
#stadium id and Stadium not one to one relationship
stadiums[stadiums.Stadium.duplicated()]
stadiums.loc[stadiums['Stadium']=='Olympiastadion']

     stadium_id         Stadium          City
233          64  Olympiastadion  Berlin West
238          69  Olympiastadion       Munich
657         161  Olympiastadion       Berlin

In [632]:
stadiums.to_sql(name='stadiums', con=engine, if_exists='append', index=False)

183

In [ ]:
stadiums.to_sql(name='world', con=engine, if_exists='append', index=False)

In [556]:
#Create worldcup table
worldcup = world_cup[['Year','Country','GoalsScored','QualifiedTeams','MatchesPlayed','Attendance']]
worldcup = worldcup.rename(columns={'Year':'worldcup_year'})

#Change attendance column from categorical to numeric
worldcup['Attendance'] = worldcup['Attendance'].str.replace('.','')
worldcup = worldcup.astype({'Attendance':int})
worldcup.rename(columns={'Country':'country','GoalsScored':'goalsscored','QualifiedTeams':'qualifiedteams','MatchesPlayed':'matchesplayed','Attendance':'attendance'},inplace=True)
worldcup

/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/986931027.py:6: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  worldcup['Attendance'] = worldcup['Attendance'].str.replace('.','')

,worldcup_year,country,goalsscored,qualifiedteams,matchesplayed,attendance
0,1930,Uruguay,70,13,18,590549
1,1934,Italy,70,16,17,363000
2,1938,France,84,15,18,375700
3,1950,Brazil,88,13,22,1045246
4,1954,Switzerland,140,16,26,768607
5,1958,Sweden,126,16,35,819810
6,1962,Chile,89,16,32,893172
7,1966,England,89,16,32,1563135
8,1970,Mexico,95,16,32,1603975
9,1974,Germany,97,16,38,1865753
10,1978,Argentina,102,16,38,1545791
11,1982,Spain,146,24,52,2109723
12,1986,Mexico,132,24,52,2394031
13,1990,Italy,115,24,52,2516215
14,1994,USA,141,24,52,3587538
15,1998,France,171,32,64,2785100
16,2002,Korea/Japan,161,32,64,2705197
17,2006,Germany,147,32,64,3359439
18,2010,South Africa,145,32,64,3178856
19,2014,Brazil,171,32,64,3386810

In [633]:
worldcup.to_sql(name='worldcup', con=engine, if_exists='append', index=False)

20

In [537]:
#Find all unique teams for each year
subset9 = world_cup_matches[['Year','Home Team Name']].dropna().append(world_cup_matches[['Year','Away Team Name']].dropna().rename(columns={'Away Team Name':'Home Team Name'}))
subset9.drop_duplicates(inplace=True)
subset9 = subset9.astype({'Year':int})
subset9['Home Team Name'] = np.where(subset9['Home Team Name'] == 'IR Iran', 'Iran', subset9['Home Team Name'])
subset9

/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/1672528924.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  subset9 = world_cup_matches[['Year','Home Team Name']].dropna().append(world_cup_matches[['Year','Away Team Name']].dropna().rename(columns={'Away Team Name':'Home Team Name'}))

     Year Home Team Name
0    1930         France
1    1930            USA
2    1930     Yugoslavia
3    1930        Romania
4    1930      Argentina
..    ...            ...
524  1998         Mexico
527  1998           Iran
528  1998        Croatia
529  1998        Tunisia
667  2006           Iran

[427 rows x 2 columns]

In [575]:
#Create new column ranking 
subset10 = world_cup[['Year','Winner']]
subset10['ranking'] = 'Winner'
subset10.rename(columns={'Winner':'Country'},inplace=True)
subset11 = world_cup[['Year','Runners-Up']]
subset11['ranking'] = 'Runners_up'
subset11.rename(columns={'Runners-Up':'Country'},inplace=True) 
subset12 = world_cup[['Year','Third']]
subset12['ranking'] = 'Third'
subset12.rename(columns={'Third':'Country'},inplace=True)
subset13 = world_cup[['Year','Fourth']]
subset13['ranking'] = 'Fourth'
subset13.rename(columns={'Fourth':'Country'},inplace=True)

subset14 = subset10.append(subset11).append(subset12).append(subset13)

/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/1758031678.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  subset10['ranking'] = 'Winner'
/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/1758031678.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  subset10.rename(columns={'Winner':'Country'},inplace=True)
/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/1758031678.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  subset11['ranking'] = 'Runners_up'
/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/1758031678.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  subset11.rename(columns={'Runners-Up':'Country'},inplace=True)
/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/1758031678.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  subset12['ranking'] = 'Third'
/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/1758031678.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  subset12.rename(columns={'Third':'Country'},inplace=True)
/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/1758031678.py:12: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  subset13['ranking'] = 'Fourth'
/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/1758031678.py:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  subset13.rename(columns={'Fourth':'Country'},inplace=True)
/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/1758031678.py:15: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  subset14 = subset10.append(subset11).append(subset12).append(subset13)
/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/1758031678.py:15: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  subset14 = subset10.append(subset11).append(subset12).append(subset13)

In [579]:
#Create worldcup_ranking dataframe
worldcup_ranking = pd.merge(subset9,subset14,left_on=['Year','Home Team Name'],right_on=['Year','Country'],how='left')
worldcup_ranking.drop(columns=['Country'],inplace=True)
worldcup_ranking.fillna('Not_ranked',inplace=True)

worldcup_ranking = pd.merge(worldcup_ranking,teams,left_on='Home Team Name',right_on='country',how='left').drop(columns=['Home Team Name','team_initial','country'])
worldcup_ranking = worldcup_ranking[['Year','team_id','ranking']]
worldcup_ranking.rename(columns={'Year':'year'},inplace=True)
worldcup_ranking.drop_duplicates(subset=['year','team_id'],inplace=True)
worldcup_ranking

     year  team_id     ranking
0    1930        1  Not_ranked
1    1930        2       Third
2    1930        3      Fourth
3    1930        4  Not_ranked
4    1930        5  Runners_up
..    ...      ...         ...
421  1998       45  Not_ranked
422  1998       24  Not_ranked
423  1998       70  Not_ranked
424  1998       60       Third
425  1998       38  Not_ranked

[425 rows x 3 columns]

In [634]:
worldcup_ranking.to_sql(name='worldcup_ranking', con=engine, if_exists='append', index=False)

425

In [618]:
#Found duplicate matches, so first drop duplicates
subset3 = world_cup_matches[['MatchID','Year','Stage','Stadium','Home Team Initials','Away Team Initials','Home Team Goals','Away Team Goals','Half-time Home Goals','Half-time Away Goals','Attendance']]
subset3_na = subset3.dropna()
subset3_no_dup = subset3_na.drop_duplicates()
subset3_no_dup = subset3_no_dup.astype({'MatchID':int,'Year':int,'Home Team Goals':int,'Away Team Goals':int,'Half-time Home Goals':int,'Half-time Away Goals':int,'Attendance':int})
subset3_no_dup

,MatchID,Year,Stage,Stadium,Home Team Initials,Away Team Initials,Home Team Goals,Away Team Goals,Half-time Home Goals,Half-time Away Goals,Attendance
0,1096,1930,Group 1,Pocitos,FRA,MEX,4,1,3,0,4444
1,1090,1930,Group 4,Parque Central,USA,BEL,3,0,2,0,18346
2,1093,1930,Group 2,Parque Central,YUG,BRA,2,1,2,0,24059
3,1098,1930,Group 3,Pocitos,ROU,PER,3,1,1,0,2549
4,1085,1930,Group 1,Parque Central,ARG,FRA,1,0,0,0,23409
...,...,...,...,...,...,...,...,...,...,...,...
831,300186504,2014,Quarter-finals,Estadio Nacional,ARG,BEL,1,0,1,0,68551
832,300186508,2014,Round of 16,Estadio Castelao,NED,MEX,2,1,0,0,58817
833,300186459,2014,Round of 16,Arena Pernambuco,CRC,GRE,1,1,0,0,41242
834,300186503,2014,Round of 16,Arena de Sao Paulo,ARG,SUI,1,0,0,0,63255
835,300186497,2014,Round of 16,Arena Fonte Nova,BEL,USA,2,1,0,0,51227

In [624]:
# create matches dataframe
merge1 = pd.merge(subset3_no_dup, teams, left_on='Home Team Initials', right_on='team_initial')

matches = pd.merge(merge1,teams, left_on='Away Team Initials', right_on='team_initial')

matches = matches.drop(['team_initial_x','country_x','team_initial_y','country_y'],axis=1)
matches = matches.rename(columns={'team_id_x':'home_team_id','team_id_y':'away_team_id'}).drop(['Home Team Initials','Away Team Initials'],axis=1)

matches =pd.merge(matches,stadiums, left_on='Stadium', right_on='stadium')
matches = matches.drop(['city','Stadium','stadium'],axis=1)
matches = matches.drop_duplicates(subset=['MatchID'])
matches.rename(columns={'MatchID':'matchid','Year':'year','Stage':'stage','Home Team Goals':'home_team_goals','Away Team Goals':'away_team_goals','Half-time Home Goals':'half_time_home_team_goals','Half-time Away Goals':'half_time_away_team_goals','Attendance':'attendance'},inplace=True)
matches

<class 'pandas.core.frame.DataFrame'>
Int64Index: 835 entries, 0 to 862
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   matchid                    835 non-null    int64
 1   year                       835 non-null    int64
 2   stage                      835 non-null    object
 3   home_team_goals            835 non-null    int64
 4   away_team_goals            835 non-null    int64
 5   half_time_home_team_goals  835 non-null    int64
 6   half_time_away_team_goals  835 non-null    int64
 7   attendance                 835 non-null    int64
 8   home_team_id               835 non-null    int64
 9   away_team_id               835 non-null    int64
 10  stadium_id                 835 non-null    int64
dtypes: int64(10), object(1)
memory usage: 78.3+ KB

In [635]:
matches.to_sql(name='matches', con=engine, if_exists='append', index=False)

835

In [602]:
#Create matches_referees dataframe

#Add referee row observation to decrease column and create ranks
subset5 = world_cup_matches[['MatchID','Referee']]
subset5.dropna(inplace=True)
subset5['referee_role']='Main'
subset6 = world_cup_matches[['MatchID','Assistant 1']]
subset6.dropna(inplace=True)
subset6.rename(columns={'Assistant 1':'Referee'},inplace=True)
subset6['referee_role']='Linesman'
subset7 = world_cup_matches[['MatchID','Assistant 2']]
subset7.dropna(inplace=True)
subset7.rename(columns={'Assistant 2':'Referee'},inplace=True)
subset7['referee_role']='Linesman'

#reference referee_id and merge dataframe
matches_referees = subset5.append(subset6).append(subset7)
new3 = matches_referees['Referee'].str.split('(',expand=True)
matches_referees['Referee'] = new3[0].str.rstrip(' ')
matches_referees = pd.merge(matches_referees,referees,left_on='Referee',right_on='name')
matches_referees = matches_referees.drop(['Referee','country_initial','name'],axis=1)
matches_referees = matches_referees.astype({'MatchID':int})
matches_referees = matches_referees[['MatchID','referee_id','referee_role']]
matches_referees.rename(columns={'MatchID':'matchid'},inplace=True)
matches_referees.drop_duplicates(subset=['matchid','referee_id'],inplace=True)
matches_referees = matches_referees.loc[matches_referees['matchid']!= 300186460]
matches_referees

/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/1291016300.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  subset5.dropna(inplace=True)
/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/1291016300.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  subset5['referee_role']='Main'
/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/1291016300.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  subset6.dropna(inplace=True)
/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/1291016300.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  subset6.rename(columns={'Assistant 1':'Referee'},inplace=True)
/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/1291016300.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  subset6['referee_role']='Linesman'
/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/1291016300.py:12: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  subset7.dropna(inplace=True)
/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/1291016300.py:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  subset7.rename(columns={'Assistant 2':'Referee'},inplace=True)
/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/1291016300.py:14: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  subset7['referee_role']='Linesman'
/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/1291016300.py:17: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  matches_referees = subset5.append(subset6).append(subset7)
/var/folders/3n/d83vbjl17f3g6f8m2s6yx4pc0000gn/T/ipykernel_2611/1291016300.py:17: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  matches_referees = subset5.append(subset6).append(subset7)

        matchid  referee_id referee_role
0          1096           1         Main
1          1092           1     Linesman
2          1094           1     Linesman
3          1089           1     Linesman
4          1090           2         Main
...         ...         ...          ...
2550  300186459         656     Linesman
2552  300186511         657     Linesman
2553  300186467         658     Linesman
2554  300186476         658     Linesman
2555  300186470         659     Linesman

[2505 rows x 3 columns]

In [636]:
matches_referees.to_sql(name='matches_referees', con=engine, if_exists='append', index=False)

505

In [491]:
#create players dataframe 

#drop na and duplicates
players = world_cup_players[['Player Name']].dropna().drop_duplicates()
#create player index
players.insert(0,'player_id',range(1,1+len(players)))
#rename column
players.rename(columns={'Player Name':'player_name'},inplace=True)
players

       player_id       player_name
0              1       Alex THEPOT
1              2   Oscar BONFIGLIO
2              3  Marcel LANGILLER
3              4      Juan CARRENO
4              5   Ernest LIBERATI
...          ...               ...
34881       7659           S W KIM
34882       7660        MOGILEVETC
34883       7661            D W JI
34884       7662             IONOV
34885       7663          J H PARK

[7663 rows x 2 columns]

In [637]:
players.to_sql(name='players', con=engine, if_exists='append', index=False)

663

In [609]:
#create match_players dataframe
subset4 = world_cup_players[['MatchID','Player Name','Team Initials','Coach Name','Line-up','Shirt Number','Position']]
subset4 = subset4.drop_duplicates(subset=['MatchID','Player Name'])

match_players = pd.merge(subset4,players,left_on='Player Name',right_on='player_name')
match_players = pd.merge(match_players,teams,left_on = 'Team Initials',right_on = 'team_initial')
match_players = match_players.drop(['Player Name','country','Team Initials','team_initial'],axis=1)
match_players = match_players.rename(columns={'Coach Name':'coach_name','Shirt Number':'shirt_no'})
match_players.rename(columns={'Line-up':'line_up','MatchID':'matchid','Position':'position'},inplace=True)
match_players = match_players[['matchid','player_id','team_id','coach_name','line_up','shirt_no','position']]
match_players = match_players.loc[match_players['matchid']!= 300186460]
match_players

,matchid,player_id,team_id,coach_name,line_up,shirt_no,position
0,1096,1,1,CAUDRON Raoul (FRA),S,0,GK
1,1085,1,1,CAUDRON Raoul (FRA),S,0,GK
2,1094,1,1,CAUDRON Raoul (FRA),S,0,GK
3,1104,1,1,KIMPTON George (ENG),S,0,GKC
4,1096,3,1,CAUDRON Raoul (FRA),S,0,NaN
...,...,...,...,...,...,...,...
37016,300186511,7482,77,SUSIC Safet (BIH),N,21,NaN
37017,300186464,7482,77,SUSIC Safet (BIH),S,21,NaN
37018,300186477,7484,77,SUSIC Safet (BIH),N,23,NaN
37019,300186511,7484,77,SUSIC Safet (BIH),N,23,NaN
37020,300186464,7484,77,SUSIC Safet (BIH),N,23,NaN

In [638]:
match_players.to_sql(name='match_players', con=engine, if_exists='append', index=False)

975

In [221]:
# new1 = match_players['coach_name'].str.split('(',expand=True)
# match_players['coach_name'] = new1[0].str.rstrip(' ')
# match_players['coach_country'] = new1[1].str.rstrip(')')
# match_players

,MatchID,coach_name,Line-up,shirt_no,Position,player_id,team_id,coach_country
0,1096,CAUDRON Raoul,S,0,GK,1,1,FRA
1,1085,CAUDRON Raoul,S,0,GK,1,1,FRA
2,1094,CAUDRON Raoul,S,0,GK,1,1,FRA
3,1104,KIMPTON George,S,0,GKC,1,1,ENG
4,1096,CAUDRON Raoul,S,0,NaN,3,1,FRA
...,...,...,...,...,...,...,...,...
37286,300186511,SUSIC Safet,N,21,NaN,7482,78,BIH
37287,300186464,SUSIC Safet,S,21,NaN,7482,78,BIH
37288,300186477,SUSIC Safet,N,23,NaN,7484,78,BIH
37289,300186511,SUSIC Safet,N,23,NaN,7484,78,BIH
37290,300186464,SUSIC Safet,N,23,NaN,7484,78,BIH

In [614]:
#Create goals_scored dataframe

#increase number of row for normalization
subset8 = world_cup_players[['MatchID','Player Name','Event']].dropna()
event = subset8.Event.str.split(' ').apply(pd.Series,1).stack(-1)
event.index = event.index.droplevel(-1)
event.name = 'event'
subset8 = subset8.join(event)

#merge dataset to get player_id
goals_scored = pd.merge(subset8,players,left_on='Player Name',right_on='player_name')
goals_scored = goals_scored.drop(['Player Name','player_name','Event'],axis=1)
goals_scored = goals_scored[['MatchID','player_id','event']]
goals_scored = goals_scored.rename(columns={'MatchID':'matchid'})
goals_scored.drop_duplicates(inplace=True)
goals_scored = goals_scored.loc[goals_scored['matchid']!= 300186460]
goals_scored

         matchid  player_id  event
0           1096          3   G40'
1           1096          4   G70'
2           1096          7   G43'
3           1096          7   G87'
4           1096         15   G19'
...          ...        ...    ...
10694  300186497       7584   Y42'
10696  300186497       7589   G93'
10698  300186497       7560   Y18'
10700  300186497       6740  I105'
10701  300186497       6740  G107'

[10404 rows x 3 columns]

In [639]:
goals_scored.to_sql(name='goals_scored', con=engine, if_exists='append', index=False)

404